/* SPDX-License-Identifier: AGPL-3.0-only */
/* SPDX-FileCopyrightText: 2025-2026 Yurii Arkhanhelskyi */
/* Описания доступа, которые ПОКАЗЫВАЕТ СИСТЕМА.
   Не переводы интерфейса: эти строки читает macOS в своём окне запроса,
   и язык там — системный, а не выбранный в настройках приложения.
   Правится вместе с macos/Runner/Info.plist: ключ, которого нет здесь,
   система покажет на языке разработки. */

"NSMicrophoneUsageDescription" = "Secretly использует микрофон для голосовых и видеозвонков, а также для записи голосовых сообщений.";
"NSCameraUsageDescription" = "Secretly использует камеру для видеозвонков и сканирования QR-кодов привязки устройств.";
"NSPhotoLibraryUsageDescription" = "Secretly использует доступ к фото для отправки изображений в чатах.";
"NSDocumentsFolderUsageDescription" = "Secretly использует доступ к документам для отправки файлов в чатах.";
"NSDownloadsFolderUsageDescription" = "Secretly использует доступ к загрузкам для сохранения файлов из чатов.";
"NSDesktopFolderUsageDescription" = "Secretly использует доступ к рабочему столу для отправки файлов и снимков экрана.";
"NSAppleEventsUsageDescription" = "Secretly использует Apple Events для связи с системными уведомлениями.";
